Revit 2027 API
Rebar.HasPresentationOverrides Method
 Identifies if this Rebar has overridden default presentation settings for the given view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasPresentationOverrides(
	View dBView
)
Public Function HasPresentationOverrides (
	dBView As View
) As Boolean
public:
bool HasPresentationOverrides(
	View^ dBView
)
member HasPresentationOverrides :
        dBView : View -> bool
Parameters
dBView View
 The view.
Return Value
Boolean
 True if this Rebar has overriden default presentation settings, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Default presentation settings can be overriden using SetBarHiddenStatus(View, Int32, Boolean), SetPresentationMode(View, RebarPresentationMode) methods
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace